gstroe/Harmony/gfx/primitive/firmware/src/system_config/pic32mx_125_sk_lcc_pictail_qvga/framework/driver/gfx/controller/lcc/drv_gfx_lcc_generic.c
  Input:
          instance - driver instance
          *color - start of the array
                  x - x coordinate of the start point.
                  y - y coordinate of the end point.
                  count - number of pixels
  Output:
         handle to the number of pixels remaining
*/
void  DRV_GFX_LCC_PixelArrayPut(GFX_COLOR *color, uint16_t x, uint16_t y, uint16_t count, uint16_t lineCount)
{
       uint16_t hchange = count;
       uint16_t tempy = y;
       y = (DISP_VER_RESOLUTION-1) - count;
       x = tempy;
       count = lineCount;
       lineCount = hchange;
    _frameAddress = (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));

    while(lineCount)
    {
       for(_pixelRendercount = count; _pixelRendercount > 0; _pixelRendercount--)
       {
			/*Suspend DMA Trigger*/
			LCCSaveData();
			if((_pixelRendercount > 4) && (PMADDR < PMP_ADDRESS_LINES-8)) //Write 8 pixels at once
			{
				PMDIN = *color++;
				_pixelRendercount -= 3;
				PMDIN = *color++;
				_frameAddress += 3;
				PMDIN = *color++;
				while(PMMODEbits.BUSY==1);
			}

	        PMDIN =  *color++;
			LCCRecoverData();
			_frameAddress++;
       }
       _frameAddress += (DISP_HOR_RESOLUTION - count);
       lineCount--;
    }
}

// *****************************************************************************
/*
  Function: uint16_t*  DRV_GFX_LCC_PixelArrayGet(uint16_t *color, uint16_t x, uint16_t y, uint16_t count)

  Summary:
    outputs an array of pixels of length count starting at *color

  Description:
    none

  Input:
          instance - driver instance
          *color - start of the array
                  x - x coordinate of the start point.
                  y - y coordinate of the end point.
                  count - number of pixels
  Output:
         handle to the number of pixels remaining
*/
uint16_t*  DRV_GFX_LCC_PixelArrayGet(GFX_COLOR *color, uint16_t x, uint16_t y, uint16_t count)
{
    uint16_t tempy = y;
    y = (DISP_VER_RESOLUTION-1) - x;
    x = tempy;
     _frameAddress =  (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));
    while(count)
    {
		/*Suspend DMA Trigger*/
		LCCSaveData();
        PMCONCLR = 0x0100;

        *color = PMDIN;
                while(PMMODEbits.BUSY==1);
        *color++ = PMDIN;

        if((count > 4) && (PMADDR < PMP_ADDRESS_LINES-8)) //Write 8 pixels at once
        {
                *color++ = PMDIN;
                _frameAddress += 3;
                *color++ = PMDIN;
                count -= 3;
                *color++ = PMDIN;

        }
        while(PMMODEbits.BUSY==1);
        PMCONSET = 0x0100;
        LCCRecoverData();

        _frameAddress++;
        count--;
	}
    return 0;
}


uint16_t prevaddr;

inline void LCCSaveData(void)
{
    while(DCH1CSIZ != 1);
    while(DrawCount > PIXEL_DRAW_PER_DMA_TX);
    DMACONbits.SUSPEND = 1;
    while(PMMODEbits.BUSY == 1); //WAIT for DMA transfer to be suspended
    //Perform Write
#ifdef ADDR15
    ADDR15 = _frameAddress >> 15; //.bits.b15;
#endif
    ADDR16 = _frameAddress >> 16; //taskIndex->address.bits.b16;
    ADDR17 = drvLCCObj.initData->activePage;
    ADDR18 = drvLCCObj.initData->activePage>>1;

    //Save previous address value
    prevaddr = PMADDR;
    PMADDR = _frameAddress;
}

inline void LCCRecoverData(void)
{
    //Clean-up Address Lines
#ifdef ADDR15
    ADDR15 = overflowcount;          //count holds the additional address line count
    ADDR16 = (overflowcount>>1);
#else
	ADDR16 = overflowcount;
#endif
    ADDR17 = drvLCCObj.initData->visualPage;
    ADDR18 = drvLCCObj.initData->visualPage>>1;
    PMADDR = prevaddr;
    DMACONbits.SUSPEND = 0;
    DrawCount++;
}

// *****************************************************************************
/* Function:
    SYS_STATUS DRV_GFX_LCC_Status ( SYS_MODULE_OBJ object )

  Summary:
    Returns status of the specific module instance of the Driver module.

  Description:
    This function returns the status of the specific module instance disabling its
    operation (and any hardware for driver modules).

  PreCondition:
    The DRV_GFX_LCC_Initialize function should have been called before calling
    this function.

  Parameters:
    object          - DRV_GFX_LCC object handle, returned from DRV_GFX_LCC_Initialize

  Returns:
    SYS_STATUS_READY    Indicates that any previous module operation for the
                        specified module has completed

    SYS_STATUS_BUSY     Indicates that a previous module operation for the
                        specified module has not yet completed

    SYS_STATUS_ERROR    Indicates that the specified module is in an error state
*/

SYS_STATUS DRV_GFX_LCC_Status ( SYS_MODULE_OBJ object )
{
    DRV_GFX_LCC_OBJ *dObj = (DRV_GFX_LCC_OBJ*)object;
    return ( dObj->state );

} /* SYS_TMR_Status */

